#### Terraform Plan: `backend-setup` ✅

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=393578471259]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "music-service-terraform-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Description" = "Terraform state locking for music-service infrastructure"
          + "Name"        = "music-service-terraform-locks"
        }
      + tags_all         = {
          + "Description" = "Terraform state locking for music-service infrastructure"
          + "Environment" = "infrastructure"
          + "ManagedBy"   = "terraform"
          + "Name"        = "music-service-terraform-locks"
          + "Project"     = "music-service"
          + "Purpose"     = "terraform-state-backend"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_s3_bucket.terraform_state will be created
  + resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "music-service-terraform-state"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Description" = "Terraform state storage for music-service infrastructure"
          + "Name"        = "music-service-terraform-state"
        }
      + tags_all                    = {
          + "Description" = "Terraform state storage for music-service infrastructure"
          + "Environment" = "infrastructure"
          + "ManagedBy"   = "terraform"
          + "Name"        = "music-service-terraform-state"
          + "Project"     = "music-service"
          + "Purpose"     = "terraform-state-backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.terraform_state will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "terraform_state" {
      + bucket                                 = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "expire-old-state-versions"
          + status = "Enabled"

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "clean-old-logs"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "access-logs/"
            }
        }
    }

  # aws_s3_bucket_policy.terraform_state will be created
  + resource "aws_s3_bucket_policy" "terraform_state" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform_state will be created
  + resource "aws_s3_bucket_public_access_block" "terraform_state" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform_state will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform_state will be created
  + resource "aws_s3_bucket_versioning" "terraform_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + backend_config         = {
      + bucket         = (known after apply)
      + dynamodb_table = "music-service-terraform-locks"
      + encrypt        = true
      + region         = "us-east-1"
    }
  + backend_config_example = (known after apply)
  + cost_estimate          = {
      + dynamodb    = "Pay-per-request: ~$0.001-$0.01 per month (very low usage)"
      + s3_requests = "$0.005/1000 PUT requests, $0.0004/1000 GET requests"
      + s3_storage  = "$0.023/GB per month (typically <$1 for state files)"
      + total       = "Estimated: $1-3 per month for typical usage"
    }
  + lock_table_arn         = (known after apply)
  + lock_table_name        = "music-service-terraform-locks"
  + migration_commands     = {
      + step_1 = "Add backend configuration to your terraform block"
      + step_2 = "Run: terraform init -migrate-state"
      + step_3 = "Answer 'yes' when prompted to migrate state"
      + step_4 = "Verify: terraform state list"
      + step_5 = "Delete local state: rm -f terraform.tfstate terraform.tfstate.backup"
    }
  + next_steps             = {
      + step_1 = "✅ Backend infrastructure created successfully!"
      + step_2 = "Configure bootstrap to use remote state:"
      + step_3 = "  cd ../bootstrap"
      + step_4 = "  # Add backend config to main.tf (see backend_config_example output)"
      + step_5 = "  terraform init -migrate-state"
      + step_6 = "Configure main infrastructure:"
      + step_7 = "  cd ../"
      + step_8 = "  # Add backend config to main.tf"
      + step_9 = "  terraform init"
    }
  + state_bucket_arn       = (known after apply)
  + state_bucket_name      = (known after apply)
  + state_bucket_region    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @asce1062, Action: `pull_request`, Workflow: `Terraform PR Automation`*